Revit 2027 API
FabricationServiceButton.ButtonIndex Property
 The button index for this button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ButtonIndex { get; }
Public ReadOnly Property ButtonIndex As Integer
	Get
public:
property int ButtonIndex {
	int get ();
}
member ButtonIndex : int with get
Property Value
Int32
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace